Ran Apply for project: `vpc` dir: `infra/vpc` workspace: `default`

<details><summary>Show Output</summary>

```diff
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/helm from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/kubernetes v2.17.0
- Using previously-installed hashicorp/helm v2.8.0
- Using previously-installed hashicorp/aws v4.54.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

time=2023-02-23T02:45:53Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/vpc/aws. Relative paths in downloaded Terraform code may not work.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "atlantis"
          + "Name"        = "devops"
          + "Terraform"   = "true"
        }
      + tags_all = {
          + "Environment" = "atlantis"
          + "Name"        = "devops"
          + "Terraform"   = "true"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "atlantis"
          + "Name"        = "devops-private-us-east-1a"
          + "Terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "atlantis"
          + "Name"        = "devops-private-us-east-1a"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "atlantis"
          + "Name"        = "devops-private-us-east-1b"
          + "Terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "atlantis"
          + "Name"        = "devops-private-us-east-1b"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "atlantis"
          + "Name"        = "devops-private-us-east-1c"
          + "Terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "atlantis"
          + "Name"        = "devops-private-us-east-1c"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "atlantis"
          + "Name"        = "devops-public"
          + "Terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "atlantis"
          + "Name"        = "devops-public"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.106.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                     = "atlantis"
          + "Name"                            = "devops-private-us-east-1a"
          + "Terraform"                       = "true"
          + "Tier"                            = "Private"
          + "kubernetes.io/cluster/devops"    = "owned"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "Environment"                     = "atlantis"
          + "Name"                            = "devops-private-us-east-1a"
          + "Terraform"                       = "true"
          + "Tier"                            = "Private"
          + "kubernetes.io/cluster/devops"    = "owned"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.106.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                     = "atlantis"
          + "Name"                            = "devops-private-us-east-1b"
          + "Terraform"                       = "true"
          + "Tier"                            = "Private"
          + "kubernetes.io/cluster/devops"    = "owned"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "Environment"                     = "atlantis"
          + "Name"                            = "devops-private-us-east-1b"
          + "Terraform"                       = "true"
          + "Tier"                            = "Private"
          + "kubernetes.io/cluster/devops"    = "owned"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.106.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                     = "atlantis"
          + "Name"                            = "devops-private-us-east-1c"
          + "Terraform"                       = "true"
          + "Tier"                            = "Private"
          + "kubernetes.io/cluster/devops"    = "owned"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "Environment"                     = "atlantis"
          + "Name"                            = "devops-private-us-east-1c"
          + "Terraform"                       = "true"
          + "Tier"                            = "Private"
          + "kubernetes.io/cluster/devops"    = "owned"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.106.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                  = "atlantis"
          + "Name"                         = "devops-public-us-east-1a"
          + "Terraform"                    = "true"
          + "kubernetes.io/cluster/devops" = "owned"
          + "kubernetes.io/role/elb"       = "1"
        }
      + tags_all                                       = {
          + "Environment"                  = "atlantis"
          + "Name"                         = "devops-public-us-east-1a"
          + "Terraform"                    = "true"
          + "kubernetes.io/cluster/devops" = "owned"
          + "kubernetes.io/role/elb"       = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.106.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                  = "atlantis"
          + "Name"                         = "devops-public-us-east-1b"
          + "Terraform"                    = "true"
          + "kubernetes.io/cluster/devops" = "owned"
          + "kubernetes.io/role/elb"       = "1"
        }
      + tags_all                                       = {
          + "Environment"                  = "atlantis"
          + "Name"                         = "devops-public-us-east-1b"
          + "Terraform"                    = "true"
          + "kubernetes.io/cluster/devops" = "owned"
          + "kubernetes.io/role/elb"       = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.106.103.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                  = "atlantis"
          + "Name"                         = "devops-public-us-east-1c"
          + "Terraform"                    = "true"
          + "kubernetes.io/cluster/devops" = "owned"
          + "kubernetes.io/role/elb"       = "1"
        }
      + tags_all                                       = {
          + "Environment"                  = "atlantis"
          + "Name"                         = "devops-public-us-east-1c"
          + "Terraform"                    = "true"
          + "kubernetes.io/cluster/devops" = "owned"
          + "kubernetes.io/role/elb"       = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "10.106.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = false
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "atlantis"
          + "Name"        = "devops"
          + "Terraform"   = "true"
        }
      + tags_all                             = {
          + "Environment" = "atlantis"
          + "Name"        = "devops"
          + "Terraform"   = "true"
        }
    }

Plan: 19 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + azs                                         = [
      + "us-east-1a",
      + "us-east-1b",
      + "us-east-1c",
    ]
  + cgw_arns                                    = []
  + cgw_ids                                     = []
  + database_nat_gateway_route_ids              = []
  + database_route_table_association_ids        = []
  + database_route_table_ids                    = (known after apply)
  + database_subnet_arns                        = []
  + database_subnets                            = []
  + database_subnets_cidr_blocks                = []
  + database_subnets_ipv6_cidr_blocks           = []
  + default_network_acl_id                      = (known after apply)
  + default_route_table_id                      = (known after apply)
  + default_security_group_id                   = (known after apply)
  + elasticache_route_table_association_ids     = []
  + elasticache_route_table_ids                 = (known after apply)
  + elasticache_subnet_arns                     = []
  + elasticache_subnets                         = []
  + elasticache_subnets_cidr_blocks             = []
  + elasticache_subnets_ipv6_cidr_blocks        = []
  + igw_arn                                     = (known after apply)
  + igw_id                                      = (known after apply)
  + intra_route_table_association_ids           = []
  + intra_route_table_ids                       = []
  + intra_subnet_arns                           = []
  + intra_subnets                               = []
  + intra_subnets_cidr_blocks                   = []
  + intra_subnets_ipv6_cidr_blocks              = []
  + name                                        = "devops"
  + nat_ids                                     = []
  + nat_public_ips                              = []
  + natgw_ids                                   = []
  + outpost_subnet_arns                         = []
  + outpost_subnets                             = []
  + outpost_subnets_cidr_blocks                 = []
  + outpost_subnets_ipv6_cidr_blocks            = []
  + private_ipv6_egress_route_ids               = []
  + private_nat_gateway_route_ids               = []
  + private_route_table_association_ids         = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_route_table_ids                     = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_subnet_arns                         = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_subnets                             = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_subnets_cidr_blocks                 = [
      + "10.106.1.0/24",
      + "10.106.2.0/24",
      + "10.106.3.0/24",
    ]
  + private_subnets_ipv6_cidr_blocks            = []
  + public_internet_gateway_route_id            = (known after apply)
  + public_route_table_association_ids          = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_route_table_ids                      = [
      + (known after apply),
    ]
  + public_subnet_arns                          = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets                              = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets_cidr_blocks                  = [
      + "10.106.101.0/24",
      + "10.106.102.0/24",
      + "10.106.103.0/24",
    ]
  + public_subnets_ipv6_cidr_blocks             = []
  + redshift_public_route_table_association_ids = []
  + redshift_route_table_association_ids        = []
  + redshift_route_table_ids                    = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + redshift_subnet_arns                        = []
  + redshift_subnets                            = []
  + redshift_subnets_cidr_blocks                = []
  + redshift_subnets_ipv6_cidr_blocks           = []
  + this_customer_gateway                       = {}
  + vpc_arn                                     = (known after apply)
  + vpc_cidr_block                              = "10.106.0.0/16"
  + vpc_enable_dns_hostnames                    = false
  + vpc_enable_dns_support                      = true
  + vpc_flow_log_destination_type               = "cloud-watch-logs"
  + vpc_id                                      = (known after apply)
  + vpc_instance_tenancy                        = "default"
  + vpc_ipv6_association_id                     = (known after apply)
  + vpc_ipv6_cidr_block                         = (known after apply)
  + vpc_main_route_table_id                     = (known after apply)
  + vpc_owner_id                                = (known after apply)
  + vpc_secondary_cidr_blocks                   = []

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/ubuntu/.atlantis/repos/Pin-Cheng/terragrunt/1/default/infra/vpc/vpc-default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/ubuntu/.atlantis/repos/Pin-Cheng/terragrunt/1/default/infra/vpc/vpc-default.tfplan"

time=2023-02-23T02:46:05Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/vpc/aws. Relative paths in downloaded Terraform code may not work.
aws_vpc.this[0]: Creating...
aws_vpc.this[0]: Creation complete after 1s [id=vpc-07970708e1f2f7ffc]
aws_subnet.public[2]: Creating...
aws_route_table.private[1]: Creating...
aws_route_table.private[0]: Creating...
aws_internet_gateway.this[0]: Creating...
aws_subnet.private[1]: Creating...
aws_subnet.public[1]: Creating...
aws_subnet.private[2]: Creating...
aws_route_table.private[2]: Creating...
aws_subnet.public[0]: Creating...
aws_subnet.private[0]: Creating...
aws_route_table.private[1]: Creation complete after 1s [id=rtb-03b39a522aa682f98]
aws_route_table.public[0]: Creating...
aws_route_table.private[0]: Creation complete after 1s [id=rtb-029b2f678ecef297b]
aws_route_table.private[2]: Creation complete after 0s [id=rtb-0410eef8835875886]
aws_subnet.private[1]: Creation complete after 1s [id=subnet-061098c83ff416339]
aws_internet_gateway.this[0]: Creation complete after 1s [id=igw-0eb7e8c593d17dfe4]
aws_subnet.private[0]: Creation complete after 0s [id=subnet-064c4b20a7ce972f5]
aws_route_table.public[0]: Creation complete after 0s [id=rtb-0f1386d0daeca089d]
aws_subnet.private[2]: Creation complete after 0s [id=subnet-0d671131aabd8a215]
aws_route.public_internet_gateway[0]: Creating...
aws_route_table_association.private[2]: Creating...
aws_route_table_association.private[1]: Creating...
aws_route_table_association.private[0]: Creating...
aws_route_table_association.private[1]: Creation complete after 1s [id=rtbassoc-06d0f4c7153361050]
aws_route_table_association.private[0]: Creation complete after 1s [id=rtbassoc-09ecfd9285c3f85ef]
aws_route_table_association.private[2]: Creation complete after 1s [id=rtbassoc-0fc3676be3d7dbbe0]
aws_route.public_internet_gateway[0]: Creation complete after 1s [id=r-rtb-0f1386d0daeca089d1080289494]
aws_subnet.public[2]: Still creating... [10s elapsed]
aws_subnet.public[1]: Still creating... [11s elapsed]
aws_subnet.public[0]: Still creating... [10s elapsed]
aws_subnet.public[2]: Creation complete after 11s [id=subnet-050284ae0db6af116]
aws_subnet.public[1]: Creation complete after 11s [id=subnet-0235af38f3e9ac33c]
aws_subnet.public[0]: Creation complete after 10s [id=subnet-0592192f1b5d28410]
aws_route_table_association.public[0]: Creating...
aws_route_table_association.public[1]: Creating...
aws_route_table_association.public[2]: Creating...
aws_route_table_association.public[2]: Creation complete after 0s [id=rtbassoc-0ed5ebccbae93056b]
aws_route_table_association.public[0]: Creation complete after 0s [id=rtbassoc-05e2146a7dcfccf84]
aws_route_table_association.public[1]: Creation complete after 0s [id=rtbassoc-000c29e700336202f]

Apply complete! Resources: 19 added, 0 changed, 0 destroyed.

Outputs:

azs = tolist([
  "us-east-1a",
  "us-east-1b",
  "us-east-1c",
])
cgw_arns = []
cgw_ids = []
database_internet_gateway_route_id = ""
database_ipv6_egress_route_id = ""
database_nat_gateway_route_ids = []
database_network_acl_arn = ""
database_network_acl_id = ""
database_route_table_association_ids = []
database_route_table_ids = [
  "rtb-029b2f678ecef297b",
  "rtb-03b39a522aa682f98",
  "rtb-0410eef8835875886",
]
database_subnet_arns = []
database_subnet_group = ""
database_subnet_group_name = ""
database_subnets = []
database_subnets_cidr_blocks = tolist([])
database_subnets_ipv6_cidr_blocks = tolist([])
default_network_acl_id = "acl-0e160f43834c9eae1"
default_route_table_id = "rtb-0c06929de1f38a9c6"
default_security_group_id = "sg-0d9116e9d6fc3009b"
default_vpc_arn = ""
default_vpc_cidr_block = ""
default_vpc_default_network_acl_id = ""
default_vpc_default_route_table_id = ""
default_vpc_default_security_group_id = ""
default_vpc_enable_dns_hostnames = ""
default_vpc_enable_dns_support = ""
default_vpc_id = ""
default_vpc_instance_tenancy = ""
default_vpc_main_route_table_id = ""
dhcp_options_id = ""
egress_only_internet_gateway_id = ""
elasticache_network_acl_arn = ""
elasticache_network_acl_id = ""
elasticache_route_table_association_ids = []
elasticache_route_table_ids = [
  "rtb-029b2f678ecef297b",
  "rtb-03b39a522aa682f98",
  "rtb-0410eef8835875886",
]
elasticache_subnet_arns = []
elasticache_subnet_group = ""
elasticache_subnet_group_name = ""
elasticache_subnets = []
elasticache_subnets_cidr_blocks = tolist([])
elasticache_subnets_ipv6_cidr_blocks = tolist([])
igw_arn = "arn:aws:ec2:us-east-1:860462047792:internet-gateway/igw-0eb7e8c593d17dfe4"
igw_id = "igw-0eb7e8c593d17dfe4"
intra_network_acl_arn = ""
intra_network_acl_id = ""
intra_route_table_association_ids = []
intra_route_table_ids = []
intra_subnet_arns = []
intra_subnets = []
intra_subnets_cidr_blocks = tolist([])
intra_subnets_ipv6_cidr_blocks = tolist([])
name = "devops"
nat_ids = []
nat_public_ips = tolist([])
natgw_ids = []
outpost_network_acl_arn = ""
outpost_network_acl_id = ""
outpost_subnet_arns = []
outpost_subnets = []
outpost_subnets_cidr_blocks = tolist([])
outpost_subnets_ipv6_cidr_blocks = tolist([])
private_ipv6_egress_route_ids = []
private_nat_gateway_route_ids = []
private_network_acl_arn = ""
private_network_acl_id = ""
private_route_table_association_ids = [
  "rtbassoc-09ecfd9285c3f85ef",
  "rtbassoc-06d0f4c7153361050",
  "rtbassoc-0fc3676be3d7dbbe0",
]
private_route_table_ids = [
  "rtb-029b2f678ecef297b",
  "rtb-03b39a522aa682f98",
  "rtb-0410eef8835875886",
]
private_subnet_arns = [
  "arn:aws:ec2:us-east-1:860462047792:subnet/subnet-064c4b20a7ce972f5",
  "arn:aws:ec2:us-east-1:860462047792:subnet/subnet-061098c83ff416339",
  "arn:aws:ec2:us-east-1:860462047792:subnet/subnet-0d671131aabd8a215",
]
private_subnets = [
  "subnet-064c4b20a7ce972f5",
  "subnet-061098c83ff416339",
  "subnet-0d671131aabd8a215",
]
private_subnets_cidr_blocks = tolist([
  "10.106.1.0/24",
  "10.106.2.0/24",
  "10.106.3.0/24",
])
private_subnets_ipv6_cidr_blocks = tolist([])
public_internet_gateway_ipv6_route_id = ""
public_internet_gateway_route_id = "r-rtb-0f1386d0daeca089d1080289494"
public_network_acl_arn = ""
public_network_acl_id = ""
public_route_table_association_ids = [
  "rtbassoc-05e2146a7dcfccf84",
  "rtbassoc-000c29e700336202f",
  "rtbassoc-0ed5ebccbae93056b",
]
public_route_table_ids = [
  "rtb-0f1386d0daeca089d",
]
public_subnet_arns = [
  "arn:aws:ec2:us-east-1:860462047792:subnet/subnet-0592192f1b5d28410",
  "arn:aws:ec2:us-east-1:860462047792:subnet/subnet-0235af38f3e9ac33c",
  "arn:aws:ec2:us-east-1:860462047792:subnet/subnet-050284ae0db6af116",
]
public_subnets = [
  "subnet-0592192f1b5d28410",
  "subnet-0235af38f3e9ac33c",
  "subnet-050284ae0db6af116",
]
public_subnets_cidr_blocks = tolist([
  "10.106.101.0/24",
  "10.106.102.0/24",
  "10.106.103.0/24",
])
public_subnets_ipv6_cidr_blocks = tolist([])
redshift_network_acl_arn = ""
redshift_network_acl_id = ""
redshift_public_route_table_association_ids = []
redshift_route_table_association_ids = []
redshift_route_table_ids = tolist([
  "rtb-029b2f678ecef297b",
  "rtb-03b39a522aa682f98",
  "rtb-0410eef8835875886",
])
redshift_subnet_arns = []
redshift_subnet_group = ""
redshift_subnets = []
redshift_subnets_cidr_blocks = tolist([])
redshift_subnets_ipv6_cidr_blocks = tolist([])
this_customer_gateway = {}
vgw_arn = ""
vgw_id = ""
vpc_arn = "arn:aws:ec2:us-east-1:860462047792:vpc/vpc-07970708e1f2f7ffc"
vpc_cidr_block = "10.106.0.0/16"
vpc_enable_dns_hostnames = false
vpc_enable_dns_support = true
vpc_flow_log_cloudwatch_iam_role_arn = ""
vpc_flow_log_destination_arn = ""
vpc_flow_log_destination_type = "cloud-watch-logs"
vpc_flow_log_id = ""
vpc_id = "vpc-07970708e1f2f7ffc"
vpc_instance_tenancy = "default"
vpc_ipv6_association_id = ""
vpc_ipv6_cidr_block = ""
vpc_main_route_table_id = "rtb-0c06929de1f38a9c6"
vpc_owner_id = "860462047792"
vpc_secondary_cidr_blocks = tolist([])

All revocation operations queued successfully!
```

</details>